# -*- coding: utf-8 -*-
"""
Задание 6.2

1. Запросить у пользователя ввод IP-адреса в формате 10.0.1.1
2. В зависимости от типа адреса (описаны ниже), вывести на стандартный поток вывода:
   'unicast' - если первый байт в диапазоне 1-223
   'multicast' - если первый байт в диапазоне 224-239
   'local broadcast' - если IP-адрес равен 255.255.255.255
   'unassigned' - если IP-адрес равен 0.0.0.0
   'unused' - во всех остальных случаях


Ограничение: Все задания надо выполнять используя только пройденные темы.
"""
ip=input('Введите IP:')
ipp=ip
ip=ip.split('.')


ip1=int(ip[0])

i=0

if (ip1>=1)  and (ip1<=223):
   i+=1
   print('unicast')
elif (ip1>=224)  and (ip1<=239):
   i+=1
   print('multicast')

if "255.255.255.255" in ipp :
   i+=1
   print('local broadcast')
elif "0.0.0.0" in ipp :
   i+=1
   print('unassigned',i)

if i==0 :
   print('unused')